<template>
    <div class="my">
        <publicTable :header="header"
                     :firstCol="firstColList"
                     :firstRow="firstRowList"
                     :tableBody="tableBodyList"></publicTable>
    </div>
</template>

<script>
import publicTable from '../../components/public-table/index';
export default {
    name: '',
    data() {
        return {
            header: '序号',
            firstColList: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
            firstRowList: ['姓名', '年龄', '性别', '爱好', '班级','最喜欢的事', '最讨厌的事', '最近学习了哪些知识'],
            tableBodyList: [
                ['小名',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小红',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小名',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小名',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小名',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小名',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小名',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小名',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小名',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小名',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小名',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小名',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小名',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小名',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小名',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小名',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小名',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小名',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小黑',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],
                ['小蓝',  '12',  '男', '唱歌',  '一班','和爸爸妈妈一起玩','学游泳','唐诗三百首' ],

            ]
        };
    },
    components: { publicTable },
    filters: {},
    computed: {},
    mounted() { },
    methods: {}
};
</script>

<style type='text/scss' lang='scss' scoped>
.my {
    width: 100%;
    height: 100%;
    // background: rgb(221, 134, 134);
}
</style>
